In [27]:
import pandas as pd
import numpy as np

In [12]:
df=pd.read_csv("Income.csv",names=["name","Income"],skiprows=[0])
df

        name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [13]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [14]:
df.Income.quantile(0.25)

5500.0

In [15]:
df.Income.quantile(0.75)

7750.0

In [16]:
df.Income.quantile(0.32)

5920.0

In [18]:
#If I Wwant lower number from percentile like lower to 50%
df.Income.quantile(0.50, interpolation='lower')

7000

In [19]:
#If I Wwant Higher number from percentile like Higher to 50%
df.Income.quantile(0.50, interpolation='higher')

7000

In [20]:
df.Income.quantile(1)

10000000.0

In [24]:
#If we want to take 99 percentile
percentile_99=df.Income.quantile(.99)
percentile_99

9400479.999999994

In [25]:
#If we want to remove outlier
no_outlier=df[df.Income<=percentile_99]
no_outlier

    name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [26]:

df

        name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [28]:
#Filling a missing values 
df['Income'][3]=np.NaN

C:\Users\Admin\AppData\Local\Temp\ipykernel_7876\2771897012.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3]=np.NaN

In [29]:
df

        name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [30]:
#Now we substitute by Nan and because it will be disaster so mean is not suitable here
df_new=df.fillna(df.Income.mean())
df_new

        name        Income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [31]:
#If we drop here median value it could be better than mean
df_new_1=df.fillna(df.Income.median())
df_new_1

        name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0